Tekla Open API Reference for Tekla Structures 2025
AnalysisResultPositions.nPositions Property
 The number of returned positions.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int nPositions { get; }
Public ReadOnly Property nPositions As Integer
	Get
Property Value
Type: Int32
See Also
Reference
AnalysisResultPositions Class
Tekla.Structures.Analysis Namespace